
{
  "title": "Atharvaveda",
  "chapters": [
    {
      "chapter": 1,
      "title": "Book 1, Hymn 3 - For Removal of Diseases",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "अपेहि मनसस्पतेऽपक्राम परश्चर । परो निर्ऋत्या आ चक्ष्व बहुधा जीवतो मनः ॥",
          "translation": "Begone, O lord of the mind; depart, wander away. Look upon distant Nirṛti (destruction); the mind of the living one is manifold."
        },
        {
          "verse": 7,
          "sanskrit": "नमस्ते मनसस्पते नमस्ते चक्षुषस्पते । नमस्ते श्रोत्रस्य पते नमस्ते वाचस्पते ॥",
          "translation": "Homage to thee, lord of the mind; homage to thee, lord of the eye. Homage to the lord of hearing; homage to thee, lord of speech."
        }
      ]
    },
    {
      "chapter": 2,
      "title": "Book 1, Hymn 34 - For long life and health",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "आयुर्दा अग्ने जरसं वृणानो घृतप्रतीको घृतपृष्ठो अग्ने । घृतं पीत्वा मधु चारु गव्यं पितेव पुत्रमभि रक्षतादिमम् ॥",
          "translation": "Giver of life, O Agni, collecting old age, with a face of ghee, with a back of ghee, O Agni; having drunk the sweet, lovely ghee of the cow, protect this man like a father his son."
        }
      ]
    },
    {
      "chapter": 3,
      "title": "Book 3, Hymn 30 - For Harmony",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "सहृदयं सांमनस्यमविद्वेषं कृणोमि वः । अन्यो अन्यमभि हर्यत वत्सं जातमिवाघ्न्या ॥",
          "translation": "I ordain for you unity of heart, unity of mind, and freedom from hatred. Love one another as the cow loves the calf she has borne."
        },
        {
          "verse": 5,
          "sanskrit": "सं गच्छध्वं सं वदध्वं सं वो मनांसि जानताम् । देवा भागं यथा पूर्वे सञ्जानाना उपासते ॥",
          "translation": "Assemble, speak together, let your minds be all of one accord. As the ancient Gods unanimous sit down to their appointed share."
        }
      ]
    },
    {
      "chapter": 4,
      "title": "Book 4, Hymn 16 - In Praise of the Sun and for Protection",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "बृहन्न् एषाम् अधिष्ठातान्तिकाद् इव पश्यति । य स्तायन् मन्यते चरन् सर्वं देवा इदं विदुः ॥",
          "translation": "He who stands, and walks, and who moves in secret, who lies down and who rises up; what two men sitting together whisper, King Varuṇa knows it, he as the third is present."
        },
        {
          "verse": 8,
          "sanskrit": "उद्यन्नादित्यो कृमिं हन्तु निम्रुचां हन्तु रश्मिभिः । ये अन्तः कृमयः गवि ॥",
          "translation": "Let the rising sun slay the worms, and the setting sun with its rays. The worms that are within the cow."
        }
      ]
    },
    {
      "chapter": 5,
      "title": "Book 6, Hymn 21 - Prayer for Forgiveness of Sins",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "यद् देवा देवहेऌअनं देवासश् चकृमा वयम् । आदित्यास् तस्मान् मा मुञ्चतर्त्वस्यर्तेन मामिता ॥",
          "translation": "Whatever offence we have, O gods, committed against you, O ye gods, from that, O Ādityas, release me, ye who are true to the sacred law."
        }
      ]
    },
    {
      "chapter": 6,
      "title": "Book 7, Hymn 52 - Prayer for a long life of a hundred autumns",
      "verses": [
        {
          "verse": 2,
          "sanskrit": "पश्येम शरदः शतम् । जीवेम शरदः शतम् । शृणुयाम शरदः शतम् । प्र ब्रवाम शरदः शतमदीनाः स्याम शरदः शतम् । भूयश्च शरदः शतात् ॥",
          "translation": "May we see a hundred autumns. May we live a hundred autumns. May we hear for a hundred autumns. May we speak for a hundred autumns; may we be independent for a hundred autumns. And even more than a hundred autumns."
        }
      ]
    },
    {
      "chapter": 7,
      "title": "Book 10, Hymn 8 - Skambha Sukta (The Cosmic Pillar)",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "कस्मिन्नङ्गे तपो अस्याधि तिष्ठति कस्मिन्नङ्ग ऋतमस्याध्याहितम् । क्व व्रतं क्व श्रद्धास्य तिष्ठति कस्मिन्नङ्गे सत्यमस्य प्रतिष्ठितम् ॥",
          "translation": "In what limb of him is austerity located? In what limb is the cosmic order placed? Where is his vow, where his faith located? In what limb of him is truth established?"
        },
        {
          "verse": 43,
          "sanskrit": "स्कम्भो दाधार द्यावापृथिवी उभे इमे स्कम्भो दाधारोर्वन्तरिक्षम् । स्कम्भो दाधार प्रदिशः षडुर्वीः स्कम्भ इदं विश्वं भुवनमा विवेश ॥",
          "translation": "The Skambha supports both heaven and earth; the Skambha supports the wide atmosphere. The Skambha supports the six wide directions; the Skambha has entered into this whole universe."
        }
      ]
    },
    {
      "chapter": 8,
      "title": "Book 11, Hymn 5 - Brahmacharya Sukta (Hymn to the Celibate Student)",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "ब्रह्मचारीष्णंश् चरति रोदसी उभे तस्मिन् देवाः संमनसो भवन्ति । स दाधार पृथिवीं दिवं च स आचार्यं तपसा पिपर्ति ॥",
          "translation": "The Brahmachari moves, quickening both the worlds; in him the gods are harmoniously united. He has sustained the earth and heaven; he fills his master with tapas (austerity)."
        }
      ]
    },
    {
      "chapter": 9,
      "title": "Book 12, Hymn 1 - Bhumi Sukta (Hymn to the Earth)",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "सत्यं बृहदृतमुग्रं दीक्षा तपो ब्रह्म यज्ञः पृथिवीं धारयन्ति । सा नो भूतस्य भव्यस्य पत्न्युरुं लोकं पृथिवी नः कृणोतु ॥",
          "translation": "Truth, eternal order that is great and stern, consecration, austerity, prayer and ritual – these uphold the Earth. May she, queen of what has been and will be, make a wide world for us."
        },
        {
          "verse": 11,
          "sanskrit": "गिरयस्ते पर्वता हिमवन्तोऽरण्यं ते पृथिवि स्योनमस्तु । बभ्रुं कृष्णां रोहिणीं विश्वरूपां ध्रुवां भूमिं पृथिवीमिन्द्रगुप्ताम् । अजीतोऽहतो अक्षतोऽध्यष्ठां पृथिवीमहम् ॥",
          "translation": "Thy snowy mountain heights and thy forests, O Earth, be pleasant to us! On the brown, the black, the red, the multi-colored, the firm earth, guarded by Indra, I, unconquered, unslain, uninjured, have stood."
        }
      ]
    },
    {
      "chapter": 10,
      "title": "Book 19, Hymn 9 - For Peace (Shanti Sukta)",
      "verses": [
        {
          "verse": 1,
          "sanskrit": "शं नो वातः पवतां शं नस्तपतु सूर्यः । शं नः कनिक्रदद् देवः पर्जन्यो अभिवर्षतु ॥",
          "translation": "May the wind blow peace to us, may the sun shine peace upon us. May the thundering god, Parjanya, shower peace upon us."
        },
        {
          "verse": 14,
          "sanskrit": "शं नो मित्रः शं वरुणः शं विष्णुः शं प्रजापतिः । शमिन्द्रो बृहस्पतिः शं नो भवत्वर्यमा ॥",
          "translation": "Peace to us Mitra, peace Varuna, peace Vishnu, peace Prajapati. Peace Indra and Brihaspati, peace be to us Aryaman."
        }
      ]
    }
  ]
}
