
[
    {
        "id": 1,
        "name": "Rudra Abhishek",
        "description": "A paramount Vedic ritual to honor Lord Rudra, a fierce form of Shiva. This powerful pooja involves the ceremonial bathing of the Shiva Lingam with sacred substances like milk, yogurt, honey, and holy water, accompanied by the continuous chanting of the Shri Rudram. It is performed to dissolve sins, purify the soul, and seek protection from all evils, bestowing peace, prosperity, and spiritual upliftment.",
        "cost": 2500,
        "duration": "Approx 1.5 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Shiva_Lingam_in_worship_at_a_home_shrine.jpg/800px-Shiva_Lingam_in_worship_at_a_home_shrine.jpg",
        "serviceType": "Temple",
        "templeIds": [1, 2, 3, 4, 7],
        "deity": "Lord Shiva (Rudra)",
        "benefits": "Cleansing of sins, removal of negative energies, bestows peace, prosperity, and spiritual growth.",
        "samagri": "Milk, Curd, Ghee, Honey, Sugar, Holy Water (Ganga Jal), Bilva Patra, Dhatura, Flowers.",
        "procedure": "The pooja begins with Ganesh Puja and Sankalpa (vow). The Shiva Lingam is then bathed with the five nectars (Panchamrit) while chanting the powerful Rudram hymns from the Yajurveda. Offerings of Bilva Patra, Dhatura, and flowers are made. The ceremony concludes with an aarti and distribution of prasad.",
        "isOnline": true
    },
    {
        "id": 2,
        "name": "Satyanarayan Pooja",
        "description": "A sacred observance dedicated to Lord Satyanarayan, the embodiment of eternal truth and a benevolent form of Lord Vishnu. This pooja is a pledge to live in truth and righteousness. Devotees listen to the divine katha (narrative) that illustrates how the Lord blesses those who are truthful and sincere, leading to fulfillment of wishes, success in endeavors, and happiness in family life.",
        "cost": 1800,
        "duration": "Approx 2 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/e/e5/Satyanarayana_Pooja.jpg/1024px-Satyanarayana_Pooja.jpg",
        "serviceType": "General",
        "templeIds": [],
        "deity": "Lord Vishnu (Satyanarayan)",
        "benefits": "Often performed after achieving a milestone like success in business, purchase of a home, or a wedding, to express gratitude and seek continued blessings for happiness and well-being of the family.",
        "samagri": "Banana, Milk, Ghee, Flour, Sugar, Tulsi leaves, Betel nuts, Flowers, Fruits.",
        "procedure": "The pooja involves the worship of Lord Satyanarayan, listening to the five chapters of his katha, offering prasad made of roasted flour and sugar, and performing aarti. It is typically performed on full moon days or before auspicious occasions.",
        "isOnline": true
    },
    {
        "id": 3,
        "name": "Maha Mrityunjaya Jaap",
        "description": "The 'Great Death-Conquering' mantra chant, an ancient and potent practice for invoking Lord Shiva's healing and protective energies. This jaap is a spiritual shield against all forms of negativity, illness, and fear. It is believed to bestow health, longevity, and moksha (liberation), acting as a divine armor for the devotee's physical and spiritual well-being.",
        "cost": 3500,
        "duration": "Min 1 hour (108 chants)",
        "imageUrl": "https://images.unsplash.com/photo-1569396342895-467ed153093c?q=80&w=800&auto=format=fit=crop",
        "serviceType": "Temple",
        "templeIds": [1, 2, 7, 3],
        "deity": "Lord Shiva (Mrityunjaya)",
        "benefits": "Promotes longevity, provides a divine shield against illness and accidents, and helps overcome fear of death.",
        "samagri": "Rudraksha mala (rosary) for chanting, water, incense, and a picture or idol of Lord Shiva.",
        "procedure": "The priest or devotee chants the Maha Mrityunjaya Mantra a specific number of times (typically 108 or in multiples of 108). The chanting is done with concentration and devotion, often accompanied by offerings to a Shiva Lingam.",
        "isOnline": true
    },
    {
        "id": 4,
        "name": "Griha Pravesh Pooja",
        "description": "An auspicious ceremony performed upon entering a new home to sanctify the space and invite divine blessings. This pooja cleanses the home of negative energies, ensures protection from unseen forces, and ushers in an era of health, happiness, and prosperity for the family residing within. It involves Vastu pooja, Ganesha pooja, and Kalash sthapana.",
        "cost": 5100,
        "duration": "Approx 2.5 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/e/e0/Griha_pravesh_pooja.jpg",
        "serviceType": "General",
        "templeIds": [],
        "deity": "Lord Ganesha & Vastu Purush",
        "benefits": "Purifies the new home, provides protection from negative influences, and brings peace, prosperity, and happiness to the residents.",
        "samagri": "Kalash, coconut, mango leaves, rice, flowers, turmeric, kumkum, and items for Homa.",
        "procedure": "The ceremony includes Vastu Shanti, Navagraha Homa, and Ganesh Pooja. The family enters the new house at an auspicious time, carrying idols and essential items, symbolizing a new beginning blessed by the divine.",
        "isOnline": false
    },
    {
        "id": 5,
        "name": "Lakshmi Kubera Pooja",
        "description": "A powerful pooja invoking the combined blessings of Goddess Lakshmi, the bestower of wealth, and Lord Kubera, the celestial treasurer. This ritual is performed to attract financial abundance, remove obstacles in business, and open new avenues of income. It is especially potent during Diwali, Dhanteras, or on Fridays for creating lasting prosperity.",
        "cost": 2100,
        "duration": "Approx 1.5 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Lakshmi_and_Kubera_by_Raja_Ravi_Varma.jpg/800px-Lakshmi_and_Kubera_by_Raja_Ravi_Varma.jpg",
        "serviceType": "General",
        "templeIds": [],
        "deity": "Goddess Lakshmi & Lord Kubera",
        "benefits": "Attracts wealth, removes financial blockages, and brings success in business and investments.",
        "samagri": "Idols of Lakshmi and Kubera, red cloth, lotus flowers, coins, turmeric, kumkum, and sweets.",
        "procedure": "The pooja involves setting up a sacred altar, invoking Lakshmi and Kubera with specific mantras, offering flowers and prasad, and chanting the Lakshmi Kubera Mantra for wealth and prosperity.",
        "isOnline": true
    },
     {
        "id": 6,
        "name": "Saraswati Vandana",
        "description": "A devotional tribute to Goddess Saraswati, the divine embodiment of knowledge, wisdom, music, and the arts. This pooja is essential for students, artists, scholars, and anyone seeking to enhance their intellectual and creative faculties. It is performed to gain clarity of thought, excel in studies, and achieve mastery in artistic pursuits.",
        "cost": 1600,
        "duration": "Approx 1 hour",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/d/d3/Saraswati_puja.jpg",
        "serviceType": "General",
        "templeIds": [],
        "deity": "Goddess Saraswati",
        "benefits": "Enhances learning capabilities, improves concentration, and bestows success in academics, music, and arts.",
        "samagri": "Idol of Goddess Saraswati, white flowers, books, musical instruments, pen, ink, and sweets.",
        "procedure": "Devotees offer prayers to Goddess Saraswati, placing educational and artistic tools before her idol. Mantras are chanted, and students seek blessings for wisdom and knowledge.",
        "isOnline": true
    },
    {
        "id": 7,
        "name": "Ganesha Homa",
        "description": "A sacred fire ritual dedicated to Lord Ganesha, the remover of all obstacles. This Homa is performed at the beginning of any new venture, project, or important life event to ensure a smooth and successful path. By offering prayers into the sacred fire, devotees seek Ganesha's blessings to clear away all impediments and grant success (Siddhi).",
        "cost": 4500,
        "duration": "Approx 2 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c3/Homa_Havan_Fire.jpg/1024px-Homa_Havan_Fire.jpg",
        "serviceType": "Temple",
        "templeIds": [20],
        "deity": "Lord Ganesha",
        "benefits": "Removes obstacles from personal and professional life, ensures success in new ventures, and provides wisdom.",
        "samagri": "Ghee, Modak, Durva grass, coconut, jaggery, and various grains for the sacred fire.",
        "procedure": "A sacred fire (Havan Kund) is prepared. The priest chants Ganesha mantras while making offerings (ahuti) into the fire, invoking the deity's powerful energy to overcome all hurdles.",
        "isOnline": true
    },
    {
        "id": 8,
        "name": "Navagraha Shanti Pooja",
        "description": "A comprehensive pooja performed to appease the nine celestial bodies (Navagrahas) that influence human destiny. This ritual helps to mitigate the negative effects of planetary positions and enhance their positive influences. It is recommended for those facing persistent life challenges, for bringing harmony, and for promoting overall well-being.",
        "cost": 6000,
        "duration": "Approx 3 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3c/Navagraha_temple.jpg/1024px-Navagraha_temple.jpg",
        "serviceType": "General",
        "templeIds": [],
        "deity": "Navagrahas (Nine Planets)",
        "benefits": "Pacifies malefic planets, strengthens benefic planets, and removes obstacles in life caused by planetary positions.",
        "samagri": "Navadhanya (nine grains), colored cloths for each planet, flowers, and specific offerings for each Graha.",
        "procedure": "The pooja involves the worship of all nine planetary deities. Specific mantras for each Graha are chanted, and offerings are made to balance their energies and seek their favor.",
        "isOnline": true
    },
    {
        "id": 9,
        "name": "Durga Saptashati Path",
        "description": "The chanting of the Durga Saptashati, a powerful scripture detailing the victory of Goddess Durga over the demon Mahishasura. This path (recitation) is performed, especially during Navratri, to invoke the Goddess's protective energy, conquer inner demons like fear and ego, and gain courage, strength, and victory over adversaries.",
        "cost": 4100,
        "duration": "Approx 2-3 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3b/Durga_idol_immersion_in_Ganges_-_Kolkata_2011-10-06_0362.JPG/1024px-Durga_idol_immersion_in_Ganges_-_Kolkata_2011-10-06_0362.JPG",
        "serviceType": "Temple",
        "templeIds": [16, 18, 19],
        "deity": "Goddess Durga",
        "benefits": "Provides protection from enemies and negative forces, grants strength and courage, and helps overcome life's challenges.",
        "samagri": "Durga Saptashati book, red cloth, red flowers, incense, lamp, and prasad.",
        "procedure": "The complete text of 700 verses from the Markandeya Purana is recited with devotion, often accompanied by a small Homa, invoking the powerful presence of the Divine Mother.",
        "isOnline": true
    },
    {
        "id": 10,
        "name": "Namakarana (Naming Ceremony)",
        "description": "The sacred Hindu naming ceremony, where a newborn is given their formal name with Vedic blessings for a long, prosperous, and righteous life. It's the first significant samskara for a child.",
        "cost": 3100,
        "duration": "Approx 1.5 hours",
        "imageUrl": "https://images.unsplash.com/photo-1596828022719-22241b1812a6?q=80&w=1024&auto=format=fit=crop",
        "serviceType": "General",
        "deity": "Agni, Ganesha",
        "benefits": "Formally establishes the child's identity, bestows blessings for a healthy and successful life, and initiates them into the family and community.",
        "samagri": "Rice grains, kalash, honey, ghee, flowers, and sweets.",
        "procedure": "Performed on the 11th or 12th day after birth, the pandit performs a small homa and whispers the chosen name into the child's ear, followed by blessings from elders.",
        "isOnline": true
    },
    {
        "id": 11,
        "name": "Annaprashana (First Rice Feeding)",
        "description": "A joyous milestone ritual marking a baby's first intake of solid food (usually rice). This ceremony seeks blessings for the child's health, digestion, and lifelong nourishment.",
        "cost": 3500,
        "duration": "Approx 1 hour",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/43/Annaprashana_sanskar.jpg/1024px-Annaprashana_sanskar.jpg",
        "serviceType": "General",
        "deity": "Annapurna, Agni",
        "benefits": "Ensures the child grows up healthy and strong, with a good appetite and digestion. Marks a key developmental stage.",
        "samagri": "Cooked rice (kheer), ghee, honey, silver bowl and spoon, and various symbolic objects (book, pen, money) for a playful ritual.",
        "procedure": "After initial prayers to deities, the maternal uncle or father feeds the baby the first morsel of solid food. This is often followed by a game where the baby chooses from symbolic objects, playfully indicating their future inclinations.",
        "isOnline": false
    },
    {
        "id": 12,
        "name": "Vivah Samskara (Marriage Ceremony)",
        "description": "The sacred Hindu wedding ceremony, a profound sacrament that unites two individuals in a bond of dharma, artha, kama, and moksha. It is a vibrant and complex ritual involving key ceremonies like Kanyadaan, Saptapadi, and Mangal Sutra, witnessed by Agni (the sacred fire).",
        "cost": 15000,
        "duration": "Approx 3-4 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/83/Hindu_wedding_ceremony_saptapadi.jpg/1024px-Hindu_wedding_ceremony_saptapadi.jpg",
        "serviceType": "General",
        "deity": "Agni, Vishnu, Lakshmi",
        "benefits": "Sanctifies the union of the couple, seeking divine blessings for a long, happy, prosperous, and dharmic life together. It establishes the foundation for the Grihastha ashrama (householder stage of life).",
        "samagri": "A vast list including Havan kund, ghee, grains, flowers, garlands, mangal sutra, sindoor, coconuts, and many other specific items.",
        "procedure": "A multi-step ritual that includes welcoming the groom (Barat), exchanging garlands (Jaimala), giving away the bride (Kanyadaan), circling the sacred fire (Agni Pradakshina), and taking the seven sacred vows (Saptapadi).",
        "isOnline": false
    },
    {
        "id": 13,
        "name": "Ayushya Homa (For Longevity)",
        "description": "A sacred fire ritual performed to seek blessings for a long, healthy, and prosperous life. It invokes Ayur Devata (the god of life), along with other deities, to ward off illnesses, grant vitality, and protect against untimely death. Often performed on birthdays.",
        "cost": 5500,
        "duration": "Approx 2 hours",
        "imageUrl": "https://images.unsplash.com/photo-1589991395897-d24f464c244b?q=80&w=1024&auto=format=fit=crop",
        "serviceType": "General",
        "deity": "Ayur Devata, Markandeya, The Chiranjivis",
        "benefits": "Promotes health and longevity, provides a spiritual shield against diseases and negative energies, and is believed to correct karmic patterns related to health.",
        "samagri": "Ghee, special herbs (samithu), rice, and other offerings for the sacred fire.",
        "procedure": "A Havan is performed with the chanting of Ayushya Suktam and other Vedic hymns. Offerings are made into the fire while praying for a long and healthy life for the individual.",
        "isOnline": true
    },
    {
        "id": 14,
        "name": "Sudarshana Homa",
        "description": "A powerful fire ceremony dedicated to Lord Sudarshana, the divine discus of Lord Vishnu. This Homa is performed to destroy negative energies, protect from harm, relieve suffering from diseases, and overcome obstacles in any endeavor.",
        "cost": 6500,
        "duration": "Approx 2.5 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Sudarshana_Homa_at_Thirunagar_SGR_Kalyanamandapam_by_Thirunagar_Brahmin_Community_2.jpg/1024px-Sudarshana_Homa_at_Thirunagar_SGR_Kalyanamandapam_by_Thirunagar_Brahmin_Community_2.jpg",
        "serviceType": "General",
        "deity": "Lord Sudarshana (Vishnu)",
        "benefits": "Provides powerful protection against enemies, evil eye, and black magic. Cures complex diseases, removes obstacles, and grants victory in legal matters and personal struggles.",
        "samagri": "Ghee, specific herbs, and other offerings for the Havan.",
        "procedure": "The ritual involves creating a Sudarshana Mandala and chanting the Sudarshana Mantra and Ashtakam while performing the fire sacrifice, invoking the swift and powerful energy of Vishnu's discus.",
        "isOnline": true
    },
    {
        "id": 15,
        "name": "Vahana Pooja (Vehicle Pooja)",
        "description": "A ritual to bless a new vehicle (car, bike, etc.), seeking protection from accidents and ensuring safe travels. It is a way of honoring the vehicle as an instrument of our work and life, invoking divine blessings to prevent unforeseen incidents.",
        "cost": 1500,
        "duration": "Approx 30 minutes",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/52/Ayudha_Puja_2011_at_Visakhapatnam_08.JPG/1024px-Ayudha_Puja_2011_at_Visakhapatnam_08.JPG",
        "serviceType": "General",
        "deity": "Vishwakarma, Ganesha",
        "benefits": "Ensures safety during travel, protects the vehicle from accidents and mechanical failures, and brings good fortune associated with the vehicle.",
        "samagri": "Flowers, garland, coconut, lemons, incense sticks, camphor, and kumkum/sandalwood paste.",
        "procedure": "The pandit draws auspicious symbols on the vehicle, chants mantras for safety, and performs a small aarti. A coconut is traditionally broken and lemons are placed under the wheels before the vehicle is moved for the first time.",
        "isOnline": false
    },
    {
        "id": 16,
        "name": "Bhoomi Pooja (Ground-breaking Ceremony)",
        "description": "An essential ritual performed before starting the construction of any house or building. This pooja is a mark of respect to Bhoomi Devi (Mother Earth) and Vastu Purush, seeking their permission and blessings to disturb the land and asking for forgiveness for the same.",
        "cost": 7500,
        "duration": "Approx 2 hours",
        "imageUrl": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/51/Bhoomi_Pooja_or_Ground_breaking_ceremony_of_the_new_premises.jpg/1024px-Bhoomi_Pooja_or_Ground_breaking_ceremony_of_the_new_premises.jpg",
        "serviceType": "General",
        "deity": "Bhoomi Devi, Vastu Purush, Ganesha",
        "benefits": "Removes negative energies and Vastu doshas from the land, ensures a smooth construction process without obstacles, and brings prosperity and well-being to the future occupants.",
        "samagri": "Kalash, coconut, navadhanya, bricks, flowers, fruits, and items for a small Homa.",
        "procedure": "The pooja is done at the north-east corner of the construction site. It involves prayers to Ganesha, Bhoomi Devi, and Vastu Purush, followed by the laying of the first foundation stone or brick at an auspicious time.",
        "isOnline": false
    }
]
